fe40/tutorials/rheoEFoam/EEI/PoissonBoltzmann/FlowFocusing/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet_top
    {
       type            zeroGradient;
    }
    
    inlet_down
    {
      type            zeroGradient;
    }

    walls
    {
        type            fixedValue;
        value           uniform -0.14;
    }

    inlet_left
    {
         type            zeroGradient;
    }

    outlet_right
    {
        type            zeroGradient;
    }
    
    "(top|base)"
    {
        type            empty;
    }  
    
}

// ************************************************************************* //
